Repository: Akeloya/Flexiobject
Catalog: Core/Properties/Resource.*.resx
Languages: ru_ru

# AuthenticationException
source: There were problems during authentication
ru_ru: Во время аутентификации возникли проблемы

# BaseGroupDisplayName
source: (All groups)
ru_ru: (Все группы)

# CoaGroupCollectionReadonlyException
source: Group collection is read only
ru_ru: Коллекция групп только для чтения

# CoaGroupModificationException
source: Modification of application access group was not permitted
ru_ru: Изменение группы доступа приложения не разрешено

# CoaGroup_AllUserName
source: [All users and groups]
ru_ru: [Все пользователи и группы]

# CoaIndexOutOfRangeException
source: Index out of collection range
ru_ru: Индекс вне диапазона коллекции

# CoaIndexOutOfRangeException_CollectionType
source: Index out of [{0}] collection range
ru_ru: Индекс вне диапазона коллекции типа [{0}]

# CoaObjectNotBelontToCollectionException
source: Object not belong to collection
ru_ru: Объект не принадлежит коллекции

# CoaObjectNotFoundException
source: Object id={0} not found
ru_ru: Объекта id={0} не был найден

# CoaProblemOnFormException
source: There are problem or error on form detected
ru_ru: Обнаружена проблема или ошибка на форме

# CoaRuleCombinationTermsAnd
source: AND
ru_ru: И

# CoaRuleCombinationTermsOr
source: OR
ru_ru: ИЛИ

# CoaRuleComparisonsTypesBelongsToGroup
source: belongs to group
ru_ru: принадлежит группе

# CoaRuleComparisonsTypesContains
source: contains
ru_ru: содержит

# CoaRuleComparisonsTypesContainsCurrentUser
source: contains current user
ru_ru: содержит текущего пользователя

# CoaRuleComparisonsTypesContainsUser
source: contains user
ru_ru: содержит пользователя

# CoaRuleComparisonsTypesDoesNotBelongToGroup
source: not belongs to group
ru_ru: не принадлежит группе

# CoaRuleComparisonsTypesDoesNotContainCurrentUser
source: not contain current user
ru_ru: не содержит текущего пользователя

# CoaRuleComparisonsTypesDoesNotMatch
source: not match
ru_ru: не совпадает

# CoaRuleComparisonsTypesGreaterThanOptionListText
source: high than
ru_ru: выше чем

# CoaRuleComparisonsTypesGreaterThanOrEqualOptionListText
source: high than from
ru_ru: выше начиная с

# CoaRuleComparisonsTypesIs
source: is
ru_ru: является

# CoaRuleComparisonsTypesIsApiInterface
source: is API interface
ru_ru: является API интерфейсом

# CoaRuleComparisonsTypesIsBackgroundProcess
source: is background process
ru_ru: является фоновым процессом

# CoaRuleComparisonsTypesIsGroup
source: is group
ru_ru: является группой

# CoaRuleComparisonsTypesIsInitialState
source: is initial state
ru_ru: начальное состояние

# CoaRuleComparisonsTypesIsInternalUser
source: is internal user
ru_ru: является внутренним пользователем

# CoaRuleComparisonsTypesIsNot
source: is not
ru_ru: не является

# CoaRuleComparisonsTypesIsNotInitialState
source: is not initial state
ru_ru: не начальное состояние

# CoaRuleComparisonsTypesIsNotInternalUser
source: is not internal user
ru_ru: не является внутренним пользователем

# CoaRuleComparisonsTypesIsNotMemberOf
source: is not member
ru_ru: не является членом

# CoaRuleComparisonsTypesIsSuperuser
source: is superuser
ru_ru: является суперпользователем

# CoaRuleComparisonsTypesIsUser
source: is user
ru_ru: является пользователем

# CoaRuleComparisonsTypesIsUserClient
source: is user client
ru_ru: является пользовательским клиентом

# CoaRuleComparisonsTypesIsVisibleForCurrentUser
source: is visible for current user
ru_ru: видим для текущего пользователя

# CoaRuleComparisonsTypesLessThanOptionListText
source: lower
ru_ru: ниже

# CoaRuleComparisonsTypesLessThanOrEqualOptionListText
source: lower from
ru_ru: ниже начиная с

# CoaRuleComparisonsTypesMatches
source: matches
ru_ru: совпадает с

# CoaRuleComparisonsTypesNotContains
source: not contains
ru_ru: не содержит

# CoaRuleComparisonsTypesNotContainsUser
source: not contains user
ru_ru: не содержит пользователя

# CoaRuleStringAlways
source: <Always>
ru_ru: <Всегда>

# CoaUserCollectionReadonlyException
source: Application user collection is read only
ru_ru: Коллекция пользователей приложения только для чтения

# CoaUserFieldAnotherFolderException
source: Cannot set object from another folder as value
ru_ru: Невозможно установить объект из другой папки в качестве значения

# CoaUserFieldArgumentObjListTypeException
source: Invalid data type for field of type ObjectList
ru_ru: Неверный тип данных для поля типа ObjectList

# CoaUserFieldException
source: An error occurred while setting or getting value
ru_ru: Произошла ошибка во время установки или получения значения

# CoaUserFieldForeignCollectionException
source: Can't install someone else's collection
ru_ru: Невозможно установить чужую коллекцию

# CoaUserFieldIncorrectInitializationException
source: Incorrectly initialized call to [SetObjectListValue]
ru_ru: Неправильно инициализирован вызов [SetObjectListValue]

# CoaUserFieldInitializationValueException
source: It is not possible to set a value other than the initial state until the object is created
ru_ru: Невозможно установить значение отличное от начального состояния пока объект не создан

# CoaUserFieldValidationGreaterThenErrorMessage
source: The field "{0}" is greater than the allowed length in {1} characters
ru_ru: Поле "{0}" больше максимальной длины в {1} символов

# CoaUserFieldValidationLessThenErrorMessage
source: The field "{0}" less than minimum length ({1})
ru_ru: Поле "{0}" меньше минимальной длины ({1})

# CoaUserLoginRequiredException
source: For the specified authentication type, you must set a login
ru_ru: Для указанного типа аутентификации необходимо установить логин

# CoaUserPasswordRequiredException
source: Password must be set for specified authentication type
ru_ru: Для указанного типа аутентификации необходимо установить пароль

# FormSetScriptExceptionStr
source: Unable to set form script because it contains errors
ru_ru: Невозможно установить скрипт для формы, так как он содержит ошибки

# GroupFolderSyncException
source: Unable to set object for folder not synchronized with application groups
ru_ru: Невозможно установить объект для папки, не синхронизированной с группами приложения

# GroupName
source: Group id={0}
ru_ru: Группа ид={0}

# GroupSyncRequestException
source: There are no object for syncronization with Group
ru_ru: Невозможно обновить группу, так как связанный объект не поддерживает обновления

# MissingStatusOnServerException
source: Status missing on server, update field edit control
ru_ru: Статус отсутствует на сервере, обновите редактор поля

# RemovingUserNotInCollectionExceptionStr
source: Removing user not belong to user collection
ru_ru: Удаляемый пользователь не принадлежит коллекции

# RestrictionRuleFailedException
source: Link rule check failed
ru_ru: Провалено правило ограничения ссылки

# RestrictionRuleFailedException_ForField
source: Unable to set field value [{0}]
ru_ru: Невозможно установить значения поля [{0}]

# SchemaHistoryArgumentException
source: During scheme history writing must declare old and new values
ru_ru: При записи переименования объекта в историю схемы, необходимо указывать старое и новое название объекта

# SchemaHistoryArgumentExceptionWithArgName
source: During scheme history writing was null argument wigh name '{0}'
ru_ru: При записи переименования объекта в историю схемы был указано не допустимое значение аргумента {0}

# SchemeNotFoundException
source: Scheme not found in database
ru_ru: Схема не была найдена в базе данных

# SerializationMessageException
source: The group cannot be updated because the linked object does not support updates
ru_ru: Имеются проблемы десериализации данных

# UserSyncRequestException
source: There are no object for syncronization with User
ru_ru: Невозможно установить объект для папки, не синхронизированной с пользователями приложения

# WorkflowNullValueException
source: Unable to set null as workflow field value
ru_ru: Невозможно установить null в качестве значения поля рабочего процесса
