Repository: Akeloya/Flexiobject
Catalog: AppClient/Properties/Resources.*.resx
Languages: ru_ru

# AppTitle
source: Custom object application
ru_ru: Приложение настраеваемых объектов

# License_CustomObjectApplication
source: Custom object application
ru_ru: Приложение настраеваемых объектов

# MenuItemEdit
source: Edit
ru_ru: Редактирование

# MenuItemEditAdd
source: Add object
ru_ru: Добавить

# MenuItemEditAddFolder
source: Add folder
ru_ru: Добавить папку

# MenuItemEditAddFolderFolder
source: Subfolder
ru_ru: Подпапку

# MenuItemEditAddFolderFolderSameLevel
source: Same leverl
ru_ru: Этого же уровня

# MenuItemEditEdit
source: Edit object
ru_ru: Редактировать

# MenuItemEditEditFolder
source: Edit folder
ru_ru: Редактировать папку

# MenuItemEditRefresh
source: Refresh
ru_ru: Обновить

# MenuItemEditRemove
source: Delete object
ru_ru: Удалить

# MenuItemEditRemoveFolder
source: Delete folder
ru_ru: Удалить папку

# MenuItemFile
source: File
ru_ru: Файл

# MenuItemFileAdmin
source: Administring
ru_ru: Администрирование

# MenuItemFileAdminActiveSessions
source: Active sessions
ru_ru: Активные сессии

# MenuItemFileAdminBlockedObjects
source: Blocked objects
ru_ru: Заблокированные объекты

# MenuItemFileAdminClientParameters
source: Client parameters
ru_ru: Параметры клиента

# MenuItemFileAdminColorSchema
source: Coloring schema
ru_ru: Цветовая схемы

# MenuItemFileAdminDeleteAllObjects
source: Delete all client objects
ru_ru: Удалить все объекты

# MenuItemFileAdminDeletionLog
source: Deletion log
ru_ru: Лог удалённых объектов

# MenuItemFileAdminGlobalForms
source: Global forms
ru_ru: Глобальные формы

# MenuItemFileAdminImageCollection
source: Image collection
ru_ru: Коллекция картинок

# MenuItemFileAdminScheduledTasks
source: Scheduled tasks
ru_ru: Запланированные задачи

# MenuItemFileAdminSchemaHistory
source: Schema history
ru_ru: История изменения схемы

# MenuItemFileAdminSystemParameters
source: System parameters
ru_ru: Системные параметры

# MenuItemFileExit
source: Exit
ru_ru: Выйти

# MenuItemFileExitAndEnter
source: Exit and enter
ru_ru: Выйти и войти

# MenuItemFileNotifyUser
source: Notify user
ru_ru: Отправить уведомление пользователю

# MenuItemFilePrint
source: Print
ru_ru: Печать

# MenuItemFileRecentObjects
source: Recent objects
ru_ru: Последние объекты

# MenuItemFileSciptsGlobal
source: Global scenarios
ru_ru: Глобальные скрипты

# MenuItemFileScripts
source: Scenarios
ru_ru: Скрипты

# MenuItemFileScriptsSearch
source: Search
ru_ru: Поиск

# MenuItemFileScriptsState
source: Status
ru_ru: Статус

# MenuItemHelp
source: Help
ru_ru: Справка

# MenuItemHelpAbout
source: About
ru_ru: О программе

# MenuItemHelpHelp
source: Help
ru_ru: Справка

# MenuItemInstruments
source: Instruments
ru_ru: Инструменты

# MenuItemInstrumentsOpenObjectById
source: Open object by id
ru_ru: Открыть объект по ИД

# MenuItemInstrumentsOpenScenarioEditor
source: Open scenario editor
ru_ru: Открыть редактор сценариев

# MenuItemInstrumentsSettings
source: Settings
ru_ru: Настройки

# MenuItemSettings
source: Settings
ru_ru: Настройки

# MenuItemSettingsApp
source: Open settings
ru_ru: Настройки приложения

# MenuItemSettingsOpenSetupFolder
source: Open setup folder
ru_ru: Папка установки

# MenuItemView
source: View
ru_ru: Вид

# MenuItemViewInstrumentPanels
source: Instrument panels
ru_ru: Панели инструментов

# MenuItemViewNotifies
source: User notifies
ru_ru: Уведомления

# MenuItemViewTreeFolder
source: Folder tree
ru_ru: Дерево папок

# MenuItemViewWorkWithFolder
source: Working with folder
ru_ru: Работа с папкой

# MenuItemViewWorkWithObject
source: Working with object
ru_ru: Работа с объектом
